# PresentItemsAsSubelements Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
RebarContainer..::..PresentItemsAsSubelements Property
RebarContainer Class See Also
---
Identifies if Items should be presented in schedules and tags as separate subelements.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2017
# Syntax
C#
---
```text
public bool PresentItemsAsSubelements { get; set; }
```

Visual Basic
---
```text
Public Property PresentItemsAsSubelements As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool PresentItemsAsSubelements {
	bool get ();
	void set (bool value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |

# See Also
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace